{"keras_version": "2.0.4", "config": [{"config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1", "dtype": "float32", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "units": 100, "batch_input_shape": [null, 343]}, "class_name": "Dense"}, {"config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "units": 100}, "class_name": "Dense"}, {"config": {"use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "mean": 0.0, "stddev": 0.05}, "class_name": "RandomNormal"}, "units": 1}, "class_name": "Dense"}], "backend": "theano", "class_name": "Sequential"}